///////////////////////////////////////////////////////////////
//                                                           //
// This is an automatically generated file.                  //
// Do *NOT* modify unless you really know what you're doing. //
//                                                           //
///////////////////////////////////////////////////////////////

#pragma once

#include <fb/AntRef.h>

namespace fb {
	struct AnimatedWeaponBinding {
		AnimatedWeaponBinding() {
		};

		AntRef m_deploy; // 0x0 (0)
		AntRef m_altDeploy; // 0x14 (20)
		AntRef m_undeploy; // 0x28 (40)
		AntRef m_quickSwitch; // 0x3C (60)
		AntRef m_reload; // 0x50 (80)
		AntRef m_reloadStage; // 0x64 (100)
		AntRef m_reloadShotgun; // 0x78 (120)
		AntRef m_fire; // 0x8C (140)
		AntRef m_fireSingle; // 0xA0 (160)
		AntRef m_fireHoldAndRelease; // 0xB4 (180)
		AntRef m_fireSimple; // 0xC8 (200)
		AntRef m_firstShotSpawned; // 0xDC (220)
		AntRef m_boltAction; // 0xF0 (240)
		AntRef m_pumpAction; // 0x104 (260)
		AntRef m_meleeAttack; // 0x118 (280)
		AntRef m_quickThrow; // 0x12C (300)
		AntRef m_quickThrowType; // 0x140 (320)
		AntRef m_aimBody; // 0x154 (340)
		AntRef m_alwaysAimHead; // 0x168 (360)
		AntRef m_oneHanded; // 0x17C (380)
		AntRef m_oneHandedAiming; // 0x190 (400)
		AntRef m_aimingEnabled; // 0x1A4 (420)
		AntRef m_lowerGun; // 0x1B8 (440)
		AntRef m_breathControl; // 0x1CC (460)
		AntRef m_rflType; // 0x1E0 (480)
		AntRef m_pstlType; // 0x1F4 (500)
		AntRef m_hgrType; // 0x208 (520)
		AntRef m_atType; // 0x21C (540)
		AntRef m_shgType; // 0x230 (560)
		AntRef m_lmgType; // 0x244 (580)
		AntRef m_bagType; // 0x258 (600)
		AntRef m_snpType; // 0x26C (620)
		AntRef m_zoom; // 0x280 (640)
		AntRef m_cantedZoom; // 0x294 (660)
		AntRef m_magnifierSightToggle; // 0x2A8 (680)
		AntRef m_aimBodyWeight; // 0x2BC (700)
		AntRef m_disableZoomToggleWeight; // 0x2D0 (720)
		AntRef m_zoomParameter; // 0x2E4 (740)
		AntRef m_zoomScaleFactor; // 0x2F8 (760)
		AntRef m_dispersion; // 0x30C (780)
		AntRef m_aimTargetPosBody; // 0x320 (800)
		AntRef m_zoomOutSpeed; // 0x334 (820)
		AntRef m_zoomInSpeed; // 0x348 (840)
		AntRef m_unDeploySpeed; // 0x35C (860)
		AntRef m_deploySpeed; // 0x370 (880)
		AntRef m_lightEnabled; // 0x384 (900)
		AntRef m_fireModeChanged; // 0x398 (920)
		AntRef m_animType; // 0x3AC (940)
		AntRef m_gunDown; // 0x3C0 (960)
		AntRef m_allowSwitchingToWeaponInWater; // 0x3D4 (980)
		AntRef m_numberOfBulletsLeftInGun; // 0x3E8 (1000)
		AntRef m_bulletsLeftInGun; // 0x3FC (1020)
		AntRef m_abortVehicleDeploy; // 0x410 (1040)
		AntRef m_customizeWeapon; // 0x424 (1060)
		AntRef m_customizeWeaponSwitch; // 0x438 (1080)
		AntRef m_weaponActionESIG; // 0x44C (1100)
		AntRef m_isSprinting; // 0x460 (1120)
		AntRef m_preparingToBash; // 0x474 (1140)
		AntRef m_justStartedSprinting; // 0x488 (1160)
		AntRef m_kickbackMagnitudeFactor; // 0x49C (1180)
		AntRef m_kickbackSpeedFactor; // 0x4B0 (1200)
		AntRef m_zoomingTime; // 0x4C4 (1220)
		AntRef m_triggerZoomGunTwitch; // 0x4D8 (1240)
		AntRef m_weaponChooserSignal; // 0x4EC (1260)
		AntRef m_weaponClassSignal; // 0x500 (1280)
		AntRef m_weaponCostumeChooserSignal; // 0x514 (1300)
		AntRef m_offsetX; // 0x528 (1320)
		AntRef m_offsetY; // 0x53C (1340)
		AntRef m_offsetZ; // 0x550 (1360)
		AntRef m_aiAllowFire; // 0x564 (1380)
		AntRef m_aiAltFireFromAnt; // 0x578 (1400)
	}; // 0x58C (1420)
}

