///////////////////////////////////////////////////////////////
//                                                           //
// This is an automatically generated file.                  //
// Do *NOT* modify unless you really know what you're doing. //
//                                                           //
///////////////////////////////////////////////////////////////

#pragma once

#include <fb/AntRef.h>

namespace fb {
	struct PVZHealthBinding {
		PVZHealthBinding() {
		};

		AntRef m_dismembermentLevel; // 0x0 (0)
		AntRef m_hideFaceProp; // 0x14 (20)
		AntRef m_hideHeadProp; // 0x28 (40)
		AntRef m_hideHead; // 0x3C (60)
		AntRef m_hideBodyProp; // 0x50 (80)
		AntRef m_hideHipsProp; // 0x64 (100)
		AntRef m_hideLeftArm; // 0x78 (120)
		AntRef m_hideLeftHandProp; // 0x8C (140)
		AntRef m_hideRightArm; // 0xA0 (160)
		AntRef m_hideRightHandProp; // 0xB4 (180)
		AntRef m_isSpawning; // 0xC8 (200)
		AntRef m_deathAnimationTriggerEnded; // 0xDC (220)
		AntRef m_explosionForce; // 0xF0 (240)
		AntRef m_explosionFacingAngle; // 0x104 (260)
		AntRef m_explosionAngleTo; // 0x118 (280)
		AntRef m_explosionDistanceTo; // 0x12C (300)
		AntRef m_forceUIStatic; // 0x140 (320)
		AntRef m_isStreaming; // 0x154 (340)
	}; // 0x168 (360)
}

