///////////////////////////////////////////////////////////////
//                                                           //
// This is an automatically generated file.                  //
// Do *NOT* modify unless you really know what you're doing. //
//                                                           //
///////////////////////////////////////////////////////////////

#pragma once

#include <fb/AntRef.h>

namespace fb {
	struct SoldierEmoteBinding {
		SoldierEmoteBinding() {
		};

		AntRef m_speak; // 0x0 (0)
		AntRef m_isSquadLeader; // 0x14 (20)
		AntRef m_emoteSpot; // 0x28 (40)
		AntRef m_emoteOk; // 0x3C (60)
		AntRef m_emoteNeedARide; // 0x50 (80)
		AntRef m_emoteGoGoGo; // 0x64 (100)
		AntRef m_emoteNeedBackup; // 0x78 (120)
		AntRef m_emoteThanks; // 0x8C (140)
		AntRef m_emoteNeedMedic; // 0xA0 (160)
		AntRef m_emoteFollowMe; // 0xB4 (180)
		AntRef m_emoteNeedAmmo; // 0xC8 (200)
		AntRef m_emoteSorry; // 0xDC (220)
		AntRef m_emoteNo; // 0xF0 (240)
		AntRef m_emoteDefendCapturePoint; // 0x104 (260)
		AntRef m_emoteAttackCapturePoint; // 0x118 (280)
		AntRef m_emoteMoveToPosition; // 0x12C (300)
	}; // 0x140 (320)
}

