///////////////////////////////////////////////////////////////
//                                                           //
// This is an automatically generated file.                  //
// Do *NOT* modify unless you really know what you're doing. //
//                                                           //
///////////////////////////////////////////////////////////////

#pragma once

#include <fb/UIElementColor.h>

namespace fb {
	struct UIColorConfiguration {
		UIColorConfiguration() {
		};

		UIElementColor m_neutral; // 0x0 (0)
		UIElementColor m_team; // 0x20 (32)
		UIElementColor m_squad; // 0x40 (64)
		UIElementColor m_enemy; // 0x60 (96)
		UIElementColor m_team1; // 0x80 (128)
		UIElementColor m_team2; // 0xA0 (160)
		UIElementColor m_team3; // 0xC0 (192)
		UIElementColor m_team4; // 0xE0 (224)
	}; // 0x100 (256)
}

